In [1]:
print("Hello World")

Hello World

In [2]:
import pandas as pd
df = pd.read_csv('sample-csv-files-sample4.csv')

In [3]:
# Fetch the first five rows
df.head()

   Game Number   "Game Length"
0            1              30
1            2              29
2            3              31
3            4              16
4            5              24

In [4]:
# Fetch the last 5 rows
df.tail()

     Game Number   "Game Length"
995          996              24
996          997              21
997          998              47
998          999              30
999         1000              12

In [5]:
# Statistical Analysis
df.describe()

       Game Number   "Game Length"
count  1000.000000     1000.000000
mean    500.500000       35.411000
std     288.819436       23.412608
min       1.000000        7.000000
25%     250.750000       19.000000
50%     500.500000       30.000000
75%     750.250000       45.000000
max    1000.000000      197.000000

In [5]:
# Datatypes of the entries in the CSV File
df.dtypes

Game Number       int64
 "Game Length"    int64
dtype: object

In [ ]:
# Handling Missing Values
df.isnull()

# Wherever there is true, that is a missing value

     Game Number   "Game Length"
0          False           False
1          False           False
2          False           False
3          False           False
4          False           False
..           ...             ...
995        False           False
996        False           False
997        False           False
998        False           False
999        False           False

[1000 rows x 2 columns]

In [ ]:
# Total Missing values
df.isnull().sum()

# No missing values in the records here

Game Number       0
 "Game Length"    0
dtype: int64

In [ ]:
# Wherever there is a missing value,it will be replaced with a zero
df.fillna(0)

In [ ]:
# Filling missing values with the mean of the column

# This line is filling missing values (NaN) in the 'Game Number' column with the mean of that column, and saving the result in a new column called 'Game_Number_fillNA'.


df['Game_Number_fillNA'] = df['Game Number'].fillna(df['Game Number'].mean())
df
# df['Game_Number_fillNA'] => creates a new column

# There is not a missing value in the current csv file
# So just code is written as an eg.

     Game Number   "Game Length"  Game_Number_fillNA
0              1              30                   1
1              2              29                   2
2              3              31                   3
3              4              16                   4
4              5              24                   5
..           ...             ...                 ...
995          996              24                 996
996          997              21                 997
997          998              47                 998
998          999              30                 999
999         1000              12                1000

[1000 rows x 3 columns]

In [3]:
df.dtypes

Game Number       int64
 "Game Length"    int64
dtype: object

In [9]:
# Renaming the columns

df = df.rename(columns={'Game Number':'Game_No'})
df.head()

   Game_No   "Game Length"
0        1              30
1        2              29
2        3              31
3        4              16
4        5              24

In [4]:
# Data Aggregating & Grouping
df.head()

grouped_mean = df.groupby('Game Number')
print(grouped_mean)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000002367602FA30>